app/views/recipes/_form.html.erb

    <div class="controls">
      <%= f.select :level_id, options_from_collection_for_select(Level.all, 'id', 'name'), :class => 'form-control' %>
---
SELECT "levels".* FROM "levels" ORDER BY "levels"."id" ASC LIMIT 1