app/controllers/levels_controller.rb

SELECT "levels".* FROM "levels"
---
  def index
    @levels = Level.all

INSERT INTO "levels" ("created_at", "description", "level", "num_smoothies_needed", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 06 Nov 2013 16:03:15 UTC +00:00], ["description", "Starting off"], ["level", 1], ["num_smoothies_needed", 1], ["updated_at", Wed, 06 Nov 2013 16:03:15 UTC +00:00]]
---
  def create
    @level = Level.new(level_params)

    respond_to do |format|
      if @level.save

SELECT "levels".* FROM "levels" WHERE "levels"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_level
      @level = Level.find(params[:id])