app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("created_at", "level_id", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 06 Nov 2013 17:06:29 UTC +00:00], ["level_id", 0], ["name", "Jetty Punch"], ["updated_at", Wed, 06 Nov 2013 17:06:29 UTC +00:00]]

  def update
    respond_to do |format|
      if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "level_id" = ?, "updated_at" = ? WHERE "recipes"."id" = 1  [["level_id", 1], ["updated_at", Wed, 06 Nov 2013 17:11:21 UTC +00:00]]